{
  "Chaitanya_Baitule_2": {
    "candidateName": "Chaitanya Baitule",
    "jobDetails": {
      "id": 2,
      "organization_id": 1,
      "team_id": null,
      "created_by": 1,
      "title": "Translator (Japanese to English & English to Japanese)",
      "description": "We are seeking a highly skilled and experienced Translator to join our dynamic team. The ideal candidate will possess exceptional fluency in both Japanese and English, with a proven ability to accurately and efficiently translate complex documents, communications, and various forms of content between the two languages. This role is crucial for facilitating seamless communication and understanding across our international operations and client base. Responsibilities: Translate a wide range of materials from Japanese to English and English to Japanese, including but not limited to: Business documents (e.g., reports, presentations, contracts, proposals) Technical documents (e.g., manuals, specifications, datasheets) Marketing and promotional content (e.g., websites, brochures, advertisements) Legal documents (e.g., agreements, patents, regulatory filings) Correspondence and internal communications Website content and software localization Ensure accuracy, nuance, and cultural appropriateness in all translations, maintaining the original meaning, tone, and intent. Conduct thorough research to understand technical terminology, industry-specific jargon, and cultural contexts relevant to the source material. Utilize Translation Memory (TM) tools and Terminology Management (TMG) systems effectively to ensure consistency and efficiency in translations. Proofread and edit translated materials to eliminate any grammat...",
      "experience_level": "Mid Level",
      "job_type": "Full Time",
      "keywords": "Translator, Japanese, English, fluency, translation, documents, communications, localization, accuracy, cultural appropriateness, terminology, proofreading, editing",
      "requirements": "Requirements not specified",
      "location": "Location not specified",
      "salary_min": null,
      "salary_max": null,
      "original_file_name": "LangTranslatorJap2English.docx",
      "status": "active",
      "approved_by": null,
      "approved_at": null,
      "closed_at": null,
      "filled_at": null,
      "requires_approval": 1,
      "auto_publish_at": null,
      "application_deadline": null,
      "settings": "{}",
      "created_at": "2025-08-21 10:53:03",
      "updated_at": "2025-08-21 10:53:03",
      "organizationId": 1,
      "teamId": null,
      "createdBy": 1,
      "experienceLevel": "Mid Level",
      "jobType": "Full Time",
      "originalFileName": "LangTranslatorJap2English.docx",
      "createdAt": "2025-08-21T10:53:03.000Z",
      "updatedAt": "2025-08-21T10:53:03.000Z"
    },
    "matchPercentage": 5
  }
}